[
  {
    "id": "1455858274376220682",
    "date": "29. May 2024",
    "image": "",
    "code": null,
    "expiry": null,
    "link": null,
    "en": {
      "title": "Viking Rise Game News",
      "content": "This is an announcement for Viking Rise game news. More details will follow in subsequent announcements."
    },
    "de": {
      "title": "Here are a few options for translating \"Viking Rise Game News\" to German, keeping the game term \"Viking Rise\" in English, and offering slight variations in nuance:\n\n**Most direct and common:**\n\n*   **Viking Rise Spiel-Nachrichten**\n\n**Slightly more formal or emphasizing \"news\" as updates/information:**\n\n*   **Viking Rise Spiel-Neuigkeiten**\n\n**If it's more about announcements or official information:**\n\n*   **Viking Rise Spiel-Infos** (Informative for \"information\")\n*   **Viking Rise Spiel-Mitteilungen** (More official sounding)\n\n**If it's specifically for a blog or news section:**\n\n*   **Viking Rise News zum Spiel** (Literally \"Viking Rise News about the Game\")\n\n**Which one to choose depends on the context:**\n\n*   **\"Viking Rise Spiel-Nachrichten\"** is generally the safest and most widely understood option.\n*   **\"Viking Rise Spiel-Neuigkeiten\"** is also very good and sounds natural.\n*   Use the others if you want to lean into a more specific connotation.",
      "content": "Here's the German translation, keeping the game terms/codes in English:\n\n\"Dies ist eine Ankündigung für **Viking Rise** game news. Weitere Details folgen in späteren Ankündigungen.\""
    },
    "cn": {
      "title": "Here's the translation of \"Viking Rise Game News\" into Chinese, keeping the game term \"Viking Rise\" in English:\n\n**Viking Rise 游戏资讯**\n\nHere's a breakdown:\n\n*   **Viking Rise:** Kept as is, as it's the game's proper name.\n*   **游戏 (yóuxì):** Means \"game\".\n*   **资讯 (zīxùn):** Means \"information\" or \"news\". This is a common and appropriate term for news related to games, technology, etc.",
      "content": "Here's the translation:\n\n这是关于 Viking Rise 游戏新闻的公告。更多详情将在后续公告中公布。"
    },
    "ru": {
      "title": "Here's the translation of \"Viking Rise Game News\" into Russian, keeping the game terms/codes in English:\n\n**Viking Rise Игровые Новости**",
      "content": "Вот перевод на русский язык:\n\nЭто объявление с новостями игры Viking Rise. Более подробная информация будет опубликована в последующих объявлениях."
    }
  },
  {
    "id": "1454944217406111948",
    "date": "25. Dec 2025",
    "image": "",
    "code": "VRXMAS2025",
    "expiry": "01/15/26 23:59 (UTC)",
    "link": "https://www.tiktok.com/@vikingrise",
    "en": {
      "title": "Holiday Goodies and Exclusive Promo Code",
      "content": "The Viking Rise team announces new holiday content, including the Snow Realm Deer Decor Item and new Hero Skins for Margit (Enchanted Snowy Night) and Bjorn (Holiday Carols). Additionally, players can claim the special promo code VRXMAS2025 as a thank you for the memories made this year. Be sure to claim the code before its expiry on January 15th, 2026."
    },
    "de": {
      "title": "Festliche Goodies und Exklusiver Promo Code",
      "content": "Das Viking Rise Team kündigt neue Feiertags-Inhalte an, darunter das Snow Realm Deer Decor Item und neue Hero Skins für Margit (Enchanted Snowy Night) und Bjorn (Holiday Carols).\n\nZusätzlich können Spieler den speziellen Promo Code VRXMAS2025 einlösen, als Dankeschön für die in diesem Jahr gesammelten Erinnerungen/Erlebnisse.\n\nStellt sicher, den Code einzulösen, bevor er am 15. Januar 2026 abläuft."
    },
    "cn": {
      "title": "节日好礼与独家 Promo Code",
      "content": "《Viking Rise》团队宣布推出新的节日内容，包括 **Snow Realm Deer Decor Item**，以及为 **Margit** (**Enchanted Snowy Night**) 和 **Bjorn** (**Holiday Carols**) 推出的全新 **Hero Skins**。\n\n此外，玩家可以领取特殊的 **promo code VRXMAS2025**，以感谢今年创造的美好回忆。请务必在代码于 2026 年 1 月 15 日过期前领取。"
    },
    "ru": {
      "title": "Праздничные подарки и эксклюзивный промокод",
      "content": "Команда Viking Rise объявляет о новом праздничном контенте, включая предмет декора Snow Realm Deer и новые облики героев для Маргит (Enchanted Snowy Night) и Бьорна (Holiday Carols).\n\nКроме того, игроки могут получить специальный промокод VRXMAS2025 в знак благодарности за воспоминания, созданные в этом году. Обязательно активируйте код до истечения срока его действия 15 января 2026 года."
    }
  }
]